In [3]:
import pandas as pd
import numpy as np

## Pandas

#### Series
#### DataFrames
#### Panel

## Pandas Series

pandas.series(data,index,dtype,copy)

In [2]:
s = pd.Series()
s

<ipython-input-2-85850638a114>:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  s = pd.Series()

Series([], dtype: float64)

In [5]:
s=pd.Series(np.array([1,2,3,4]))
s

0    1
1    2
2    3
3    4
dtype: int32

In [6]:
#list as data
pd.Series([1,2,3])

0    1
1    2
2    3
dtype: int64

In [9]:
#dictionary as data
pd.Series({"a":23,"b":45,"c":43})

a    23
b    45
c    43
dtype: int64

In [12]:
#index 
s=pd.Series([1,2,3],index=[100,102,103])
s

100    1
102    2
103    3
dtype: int64

In [13]:
s[100] #accessing element using index

1

In [14]:
#create series with constant value
pd.Series(3,index=[1,2,3])

1    3
2    3
3    3
dtype: int64

In [15]:
s[:]

100    1
102    2
103    3
dtype: int64

In [17]:
s[::2] #one dim

100    1
103    3
dtype: int64

In [24]:
pd.Series([1,2,3,4,5,6])[::-1]

5    6
4    5
3    4
2    3
1    2
0    1
dtype: int64

### DataFrame

In [25]:
df=pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [27]:
type(df)

pandas.core.frame.DataFrame

In [30]:
#Dataframe form list
data=[["abc",34],["xyz",45],["pqr",45]]
df=pd.DataFrame(data,columns=["Name","Marks"])
df

  Name  Marks
0  abc     34
1  xyz     45
2  pqr     45

In [33]:
#Dataframe from Dictionary
data={"Name":["a","b","c"],"Marks":[3,4,5]}
df=pd.DataFrame(data,index=["student 1","student 2","student 3"])
df

          Name  Marks
student 1    a      3
student 2    b      4
student 3    c      5

In [36]:
df["Name"]

student 1    a
student 2    b
student 3    c
Name: Name, dtype: object

In [37]:
df["Name"]["student 1"]

'a'

In [40]:
df[["Name","Marks"]]

          Name  Marks
student 1    a      3
student 2    b      4
student 3    c      5

### Selection of rows and columns

In [63]:
data={"Name":["a","b","c","d"],"Marks":[3,4,5,7]}
df=pd.DataFrame(data)
df

  Name  Marks
0    a      3
1    b      4
2    c      5
3    d      7

### Pandas iloc

In [42]:
df.iloc[0,1]

3

In [43]:
df.iloc[0,]

Name     a
Marks    3
Name: 0, dtype: object

In [45]:
type(df.iloc[0,]) #single col or single row becomes pandas series

pandas.core.series.Series

In [46]:
#slicing in iloc
df.iloc[::2,:]

  Name  Marks
0    a      3
2    c      5

In [49]:
#list of index in iloc
df.iloc[[1,2,3],[1]]

   Marks
1      4
2      5
3      7

### Pandas.loc

In [50]:
df.loc[0,"Name"]

'a'

In [51]:
df.loc[:,"Name"]

0    a
1    b
2    c
3    d
Name: Name, dtype: object

In [52]:
df.loc[:,["Name","Marks"]]

  Name  Marks
0    a      3
1    b      4
2    c      5
3    d      7

### DataFrame Information

In [53]:
df.columns

Index(['Name', 'Marks'], dtype='object')

In [54]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Marks   4 non-null      int64
dtypes: int64(1), object(1)
memory usage: 192.0+ bytes

In [55]:
df.describe()

          Marks
count  4.000000
mean   4.750000
std    1.707825
min    3.000000
25%    3.750000
50%    4.500000
75%    5.500000
max    7.000000

### Add Rows in Dataframe

In [61]:
df_add=pd.DataFrame({"Name":["e","f"],"Marks":[7,8]})

df=df.append(df_add)
df

  Name  Marks
0    a      3
1    b      4
2    c      5
3    d      7
0    e      7
1    f      8

### Delete Columns

In [62]:
df=df.drop(columns=["Marks"])
df

  Name
0    a
1    b
2    c
3    d
0    e
1    f

In [72]:
df.to_csv("data.csv",index=False)

In [96]:
### Read CSV File 
df=pd.read_csv("data.csv")
df

   Unnamed: 0 Name  Marks
0           0    a      3
1           1    b      4
2           2    c      5
3           3    d      7

In [79]:
#get First row
df.head(2)

   Unnamed: 0 Name  Marks
0           0    a      3
1           1    b      4

In [80]:
#get Last row
df.tail(2)

   Unnamed: 0 Name  Marks
2           2    c      5
3           3    d      7

In [81]:
#shape of df
df.shape

(4, 3)

In [82]:
df.ndim

2

In [83]:
df.size

12

### statistics

In [84]:
df.sum()

Unnamed: 0       6
Name          abcd
Marks           19
dtype: object

In [85]:
df.sum(1) #columns added with each other

0     3
1     5
2     7
3    10
dtype: int64

In [86]:
df.mean() #average of each numerical column

Unnamed: 0    1.50
Marks         4.75
dtype: float64

In [87]:
df.std()

Unnamed: 0    1.290994
Marks         1.707825
dtype: float64

In [88]:
df.count()

Unnamed: 0    4
Name          4
Marks         4
dtype: int64

In [89]:
df.median()

Unnamed: 0    1.5
Marks         4.5
dtype: float64

In [90]:
df.max()

Unnamed: 0    3
Name          d
Marks         7
dtype: object

In [91]:
df.min()

Unnamed: 0    0
Name          a
Marks         3
dtype: object

### Reindexing

In [99]:
df.reindex(index=[1,2,3,4])

   Unnamed: 0 Name  Marks
1         1.0    b    4.0
2         2.0    c    5.0
3         3.0    d    7.0
4         NaN  NaN    NaN

### Sorting

In [103]:
#sort_values
df.sort_values(by="Marks",ascending=False)

   Unnamed: 0 Name  Marks
3         3.0    d    7.0
2         2.0    c    5.0
1         1.0    b    4.0
4         NaN  NaN    NaN

In [102]:
help(df.sort_values)

Help on method sort_values in module pandas.core.frame:

sort_values(by, axis=0, ascending=True, inplace=False, kind='quicksort', na_position='last', ignore_index=False, key: Union[Callable[[ForwardRef('Series')], Union[ForwardRef('Series'), ~AnyArrayLike]], NoneType] = None) method of pandas.core.frame.DataFrame instance
    Sort by the values along either axis.

    Parameters
    ----------
            by : str or list of str
                Name or list of names to sort by.

                - if `axis` is 0 or `'index'` then `by` may contain index
                  levels and/or column labels.
                - if `axis` is 1 or `'columns'` then `by` may contain column
                  levels and/or index labels.

                .. versionchanged:: 0.23.0

                   Allow specifying index or column level names.
    axis : {0 or 'index', 1 or 'columns'}, default 0
         Axis to be sorted.
    ascending : bool or list of bool, default True
         Sort ascending vs. descending. Specify list for multiple sort
         orders.  If this is a list of bools, must match the length of
         the by.
    inplace : bool, default False
         If True, perform operation in-place.
    kind : {'quicksort', 'mergesort', 'heapsort'}, default 'quicksort'
         Choice of sorting algorithm. See also ndarray.np.sort for more
         information.  `mergesort` is the only stable algorithm. For
         DataFrames, this option is only applied when sorting on a single
         column or label.
    na_position : {'first', 'last'}, default 'last'
         Puts NaNs at the beginning if `first`; `last` puts NaNs at the
         end.
    ignore_index : bool, default False
         If True, the resulting axis will be labeled 0, 1, â€¦, n - 1.

         .. versionadded:: 1.0.0

    key : callable, optional
        Apply the key function to the values
        before sorting. This is similar to the `key` argument in the
        builtin :meth:`sorted` function, with the notable difference that
        this `key` function should be *vectorized*. It should expect a
        ``Series`` and return a Series with the same shape as the input.
        It will be applied to each column in `by` independently.

        .. versionadded:: 1.1.0

    Returns
    -------
    DataFrame or None
        DataFrame with sorted values if inplace=False, None otherwise.

    See Also
    --------
    DataFrame.sort_index : Sort a DataFrame by the index.
    Series.sort_values : Similar method for a Series.

    Examples
    --------
    >>> df = pd.DataFrame({
    ...     'col1': ['A', 'A', 'B', np.nan, 'D', 'C'],
    ...     'col2': [2, 1, 9, 8, 7, 4],
    ...     'col3': [0, 1, 9, 4, 2, 3],
    ...     'col4': ['a', 'B', 'c', 'D', 'e', 'F']
    ... })
    >>> df
      col1  col2  col3 col4
    0    A     2     0    a
    1    A     1     1    B
    2    B     9     9    c
    3  NaN     8     4    D
    4    D     7     2    e
    5    C     4     3    F

    Sort by col1

    >>> df.sort_values(by=['col1'])
      col1  col2  col3 col4
    0    A     2     0    a
    1    A     1     1    B
    2    B     9     9    c
    5    C     4     3    F
    4    D     7     2    e
    3  NaN     8     4    D

    Sort by multiple columns

    >>> df.sort_values(by=['col1', 'col2'])
      col1  col2  col3 col4
    1    A     1     1    B
    0    A     2     0    a
    2    B     9     9    c
    5    C     4     3    F
    4    D     7     2    e
    3  NaN     8     4    D

    Sort Descending

    >>> df.sort_values(by='col1', ascending=False)
      col1  col2  col3 col4
    4    D     7     2    e
    5    C     4     3    F
    2    B     9     9    c
    0    A     2     0    a
    1    A     1     1    B
    3  NaN     8     4    D

    Putting NAs first

    >>> df.sort_values(by='col1', ascending=False, na_position='first')
      col1  col2  col3 col4
    3  NaN     8     4    D
    4    D     7     2    e
    5    C     4     3    F
    2    B     9     9    c
    0    A     2     0    a
    1    A     1     1    B

    Sorting with a key function

    >>> df.sort_values(by='col4', key=lambda col: col.str.lower())
       col1  col2  col3 col4
    0    A     2     0    a
    1    A     1     1    B
    2    B     9     9    c
    3  NaN     8     4    D
    4    D     7     2    e
    5    C     4     3    F

In [104]:
#sort index
df.sort_index(ascending=False)

   Unnamed: 0 Name  Marks
4         NaN  NaN    NaN
3         3.0    d    7.0
2         2.0    c    5.0
1         1.0    b    4.0